week 1/lab1_part2/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.2 0 0)
    (0.2 0.1 0)
    (0 0.1 0)
    (0.2 0.2 0)
    (0 0.2 0)
    (0 0 1)
    (0.2 0 1)
    (0.2 0.1 1)
    (0 0.1 1)
    (0.2 0.2 1)
    (0 0.2 1)
);

blocks
(
    hex (0 1 2 3 6 7 8 9) (24 12 1) simpleGrading (1 20 1)
    hex (3 2 4 5 9 8 10 11) (24 12 1) simpleGrading (1 0.05 1)
); 

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (5 11 10 4)
            (0 1 7 6)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 6 9 3)
            (3 9 11 5)
            (8 2 4 10)
            (7 1 2 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 5 4 2)
            (8 10 11 9)
            (7 8 9 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
